/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   chek_step.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: solefir <solefir@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/06/27 16:55:38 by solefir           #+#    #+#             */
/*   Updated: 2019/06/27 19:28:32 by solefir          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */


#include "filler.h"
#include <stdio.h> //

void	check_step(t_f *filler, int y, int x)
{
	if (!enemy_near && )
}

/* 
		1. проверить свою позицию на карте. стремиться заполнить большую часть карты.
		2. где находится враг, если он прорвался на мою сторону, то необходимо ему срезать путь
		3. расстояние между мной и врагом. если большое, то можно двигаться по направлению к врагу и на полпути начинать окружать
*/